#!/bin/bash

#============================================================
# Установка и настройка nginx
#============================================================

if [ "$EUID" -ne 0 ]
then
    echo "Нужны повышенные привелегии, используй sudo"
    exit
fi

echo "============================================================"
echo "Установка Nginx"
echo "============================================================"
apt install nginx -y

echo "============================================================"
echo "Установка Nginx завершена. Копируем файлы конфигурации"
echo "============================================================"
cp ./config/nginx.conf /etc/nginx/sites-available/default 
sleep 3
echo "============================================================"
echo "Перезапускаем службу Nginx"

systemctl enable --now nginx

echo "============================================================"
echo "Установка Nginx завершена. Запусти файл 02_install-apache.sh"
echo "============================================================"
