#!/bin/bash

#============================================================
# Установка и настройка apache
#============================================================

if [ "$EUID" -ne 0 ]
then
    echo "Нужны повышенные привелегии, используй sudo"
    exit
fi
echo "============================================================"
echo "Начинаем установку Apache2"
echo "============================================================"

apt install apache2 -y

echo "============================================================"
echo "Установка Apache2 завершена. Копируем статические файлы и файлы конфигурации"
echo "============================================================"
cp -r ./statics/html* /var/www/
cp ./config/apache.conf /etc/apache2/sites-available/000-default.conf
cp ./config/apache_ports.conf /etc/apache2/ports.conf
sleep 3
echo "============================================================"
echo "Перезапускаем службы Apache2 и Nginx"
systemctl restart apache2
systemctl reload nginx
systemctl enable apache2

echo "============================================================"
echo "Установка Apache2 и Nginx завершена. Запусти файл 03_install-database_master.sh"
echo "============================================================"